Revit 2027 API
ParameterTypeId.LoadCaseNature Property
 "Nature"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LoadCaseNature { get; }
Public Shared ReadOnly Property LoadCaseNature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LoadCaseNature {
	ForgeTypeId^ get ();
}
static member LoadCaseNature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace